'''
1)Представьте, что вы разрабатываете программу для автоматического определения 
времени сутокна основе текущего часа.Ваша задача - написать программу на Python, 
которая принимает на вход значение текущего часа (от 0 до 23) 
и выводит соответствующее время суток: 
"Ночь (0 - 6)", "Утро (7 - 12)", "День (13 - 18)" или "Вечер (18 - 23)". 
Используйте условные операторы (if, elif, else) для определения времени суток. 
Пример: Введите текущий час (от 0 до 23):
Ввод: 14 
Вывод: День
''' 

# h=int(input('Введите время суток от 0 до 23: '))
# if 0<=h<=6:
#     print('Сейчас ночь🌚')
# elif 7>=h<=12:
#     print('Сейчас утро☀️')
# elif 13>=h<=18:
#     print('Сейчас день🌞')
# elif 18<=h>=23:
#     print('Сейчас вечер🌑')
# else:
#     print('Ошибка❌')
    
