# Нужно написать программу, которая будет считать количество элементов в переменной выше
# (разделите три значения по символу ',')

qwerty = "AAA, BBB, CCC".split(',')
print(len(qwerty))
