'1.Напишите код который выводит информацию о вас'
print('Имя:Бека')
print('Пол:мужской')
print('Возраст:18')
'2.Напишите код который выводит результат арифметических действий'
print(5+5) #сложение
print(5-4) #вычитание
print(5*5) #умножение
print(4/2) #деление с остатком
print(5**5) #возведение в степень
print(4//2) #деление с округлением к меньшему
'3.Напишите код , которая выводит сумму чисел 57 и 93'
print(57+93)
'4. Напишите программу, которая выводит 5 в степени 3'
print(5**3)
