print("Hello World")
print("Beka")
# коментарий или же архивировние
"коментарий"
'коментарий'
"""
коментарий
коментарий
"""
'''
коментарий
коментарий
'''
'Арифметические выражение'
print(2+2) #сложение
print(3-2) #вычитание
print(3/2) #деление с остатком
print(3//2) #деление с округлением к меньшиму
print(5*5) #умножение
print(5**5) #возведение в степень
'Операторы сравнения'
print(5<4) #больше чем х
print(5>4) #меньшн чем х
print(5<=4) #больше чем или равно 
print(5>=4) #меньше чем или равно
print(5==5) #равно
print('5=4') #знак присвоение
print(2+2==4, 2+2, "hello world")
