input #команда для ввода
print #команда для вывода

'Переменые'
input('Введите имя:')
input('Укажите возраст:')

a=5
b=1
# c=a+b
print(a+b)

name=input("введите имя")
print("привет",name)

'''
Правила объявления переменных:
нельзя начинать название переменной с цифры
в названиях переменных разрешаются только буквы латинского алфавита, цифры и нижний пробел
переменная также может состоять из одного пробела
Названия переменных должны четко указывать, что в них хранится или же иметь смысловую связь.
'''
    
'Регистры способ создания переменной с названием из нескольких слов'

myfirstname = "Сыймык"
my_first_name = "Сыймык"

"snake case - змеиный регистр"
my_first_name = "Сыймык"

"camel case - верблюжий регистр"
MyFirstName = "Сыймык"

"верхний регистр"
NAME = "Сыймык"

"нижний регистр"

name = "Сыймык"
num1=int(input('введите первое число: '))
num2=int(input('введите второе число: '))
print(num1+num2)
